In [1]:
import pandas as pd
import numpy as np

#### Finding Data type

In [2]:
my_series=pd.Series([9.6,54.96,14.98,41/65])
my_Series=pd.Series(['ad','da','wsed'])
print (my_series.dtype)

float64

### Converting to list

In [3]:
print (my_series.tolist())

[9.6, 54.96, 14.98, 0.6307692307692307]

### Pandas Data Frame

A Pandas dataframe is a tabular data structure that stores data in the form of rows and columns.As a standard,the rows correspond to records while column refers to attributes.In simplest words,a Pandas dataframe is a collection of series

### Empty dataframe

In [4]:
my_df = pd.DataFrame()
print (my_df)

Empty DataFrame
Columns: []
Index: []

## Dataframe using list of lists

In [5]:
scores = [['Mathematics',54,'BIBEN',9846],['English',58,'GEO',456],['Geography',52,'joyal',4523],['Civics',46,'arun',4587]]
my_df = pd.DataFrame(scores,columns=['Subject','Score','Name','ID'])
my_df

       Subject  Score   Name    ID
0  Mathematics     54  BIBEN  9846
1      English     58    GEO   456
2    Geography     52  joyal  4523
3       Civics     46   arun  4587

In [6]:
2.354*54.541

128.389514

### DATA FRAME USING DICTIONARIES

In [7]:
SCORES={'NAME':['ENGLISH','CHEMISTRY','BIOLOGY','PHYSICS','ENGLISH 2'],'SCORE':[98,45,15,78,94]}
my_df =pd.DataFrame(SCORES)
my_df

        NAME  SCORE
0    ENGLISH     98
1  CHEMISTRY     45
2    BIOLOGY     15
3    PHYSICS     78
4  ENGLISH 2     94

### DATAFRAME USING LIST OF DICTIONARIES

In [12]:
scores = [
    {'Subject':'English','Score':65},
    {'Subject':'PHYSICS','Score':76},
    {'Score':78,'Subject':'ENGLISH 2'},
    {'Score':4000/46,'Subject':'CHEMISTRY'}
]
my_df = pd.DataFrame(scores)
my_df

     Subject      Score
0    English  65.000000
1    PHYSICS  76.000000
2  ENGLISH 2  78.000000
3  CHEMISTRY  86.956522

### 4.Dataframe using list of dictionaries with null items

In [19]:
scores=[
    {'Subject':'CHEMISTRY','Score':84},
    {'Score':78},
    {'Subject':'POLITICAL SCIENCE','Score':89},
    {'Subject':'ENVIRNOMENTAL SCENCE','Score':54},
    {'Subject':'DATA SCIENCE',}
]
my_df = pd.DataFrame(scores)
my_df

                Subject  Score
0             CHEMISTRY   84.0
1                   NaN   78.0
2     POLITICAL SCIENCE   89.0
3  ENVIRNOMENTAL SCENCE   54.0
4          DATA SCIENCE    NaN